NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/BGM24/BGM240PB32VNA.svd
        <register>
          <name>I2SCTRL</name>
          <description>No Description</description>
          <addressOffset>0x054</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000071F</resetMask>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable I2S Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MONO</name>
              <description>Stero or Mono</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>JUSTIFY</name>
              <description>Justification of I2S Data</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LEFT</name>
                  <description>Data is left-justified</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RIGHT</name>
                  <description>Data is right-justified</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMASPLIT</name>
              <description>Separate DMA Request For Left/Right Data</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY</name>
              <description>Delay on I2S data</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORMAT</name>
              <description>I2S Word Format</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>W32D32</name>
                  <description>32-bit word, 32-bit data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>W32D24M</name>
                  <description>32-bit word, 32-bit data with 8 lsb masked</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>W32D24</name>
                  <description>32-bit word, 24-bit data</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>W32D16</name>
                  <description>32-bit word, 16-bit data</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>W32D8</name>
                  <description>32-bit word, 8-bit data</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>W16D16</name>
                  <description>16-bit word, 16-bit data</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>W16D8</name>
                  <description>16-bit word, 8-bit data</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>W8D8</name>
                  <description>8-bit word, 8-bit data</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING</name>
          <description>No Description</description>
          <addressOffset>0x058</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x77770000</resetMask>
          <fields>
            <field>
              <name>TXDELAY</name>
              <description>TX frame start delay</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable - TXDELAY in USARTn_CTRL can be used for legacy</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>Start of transmission is delayed for 1 baud-times</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWO</name>
                  <description>Start of transmission is delayed for 2 baud-times</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THREE</name>
                  <description>Start of transmission is delayed for 3 baud-times</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEVEN</name>
                  <description>Start of transmission is delayed for 7 baud-times</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCMP0</name>
                  <description>Start of transmission is delayed for TCMPVAL0 baud-times</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCMP1</name>
                  <description>Start of transmission is delayed for TCMPVAL1 baud-times</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCMP2</name>
                  <description>Start of transmission is delayed for TCMPVAL2 baud-times</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CSSETUP</name>
              <description>Chip Select Setup</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>CS is not asserted before start of transmission</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>CS is asserted for 1 baud-times before start of transmission</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWO</name>
                  <description>CS is asserted for 2 baud-times before start of transmission</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THREE</name>
                  <description>CS is asserted for 3 baud-times before start of transmission</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEVEN</name>
                  <description>CS is asserted for 7 baud-times before start of transmission</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCMP0</name>
                  <description>CS is asserted before the start of transmission for TCMPVAL0 baud-times</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCMP1</name>
                  <description>CS is asserted before the start of transmission for TCMPVAL1 baud-times</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCMP2</name>
                  <description>CS is asserted before the start of transmission for TCMPVAL2 baud-times</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ICS</name>
              <description>Inter-character spacing</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>There is no space between charcters</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>Create a space of 1 baud-times before start of transmission </description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWO</name>
                  <description>Create a space of 2 baud-times before start of transmission</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THREE</name>
                  <description>Create a space of 3 baud-times before start of transmission</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEVEN</name>
                  <description>Create a space of 7 baud-times before start of transmission</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCMP0</name>
                  <description>Create a space of before the start of transmission for TCMPVAL0 baud-times</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCMP1</name>
                  <description>Create a space of before the start of transmission for TCMPVAL1 baud-times</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCMP2</name>
                  <description>Create a space of before the start of transmission for TCMPVAL2 baud-times</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CSHOLD</name>
              <description>Chip Select Hold</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Disable CS being asserted after the end of transmission</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>CS is asserted for 1 baud-times after the end of transmission</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWO</name>
                  <description>CS is asserted for 2 baud-times after the end of transmission</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THREE</name>
                  <description>CS is asserted for 3 baud-times after the end of transmission</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEVEN</name>
                  <description>CS is asserted for 7 baud-times after the end of transmission</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCMP0</name>
                  <description>CS is asserted after the end of transmission for TCMPVAL0 baud-times</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCMP1</name>
                  <description>CS is asserted after the end of transmission for TCMPVAL1 baud-times</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCMP2</name>
                  <description>CS is asserted after the end of transmission for TCMPVAL2 baud-times</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLX</name>
          <description>No Description</description>
          <addressOffset>0x05C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x8000808F</resetMask>
          <fields>
            <field>
              <name>DBGHALT</name>
              <description>Debug halt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Continue to transmit until TX buffer is empty</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Negate RTS to stop link partner's transmission during debug HALT. NOTE** The core clock should be equal to or faster than the peripheral clock; otherwise, each single step could transmit multiple frames instead of just transmitting one frame.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTSINV</name>
              <description>CTS Pin Inversion</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>The USn_CTS pin is low true</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>The USn_CTS pin is high true</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTSEN</name>
              <description>CTS Function enabled</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Ingore CTS</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Stop transmitting when CTS is negated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTSINV</name>
              <description>RTS Pin Inversion</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>The USn_RTS pin is low true</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>The USn_RTS pin is high true</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXPRSEN</name>
              <description>PRS RX Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLKPRSEN</name>
              <description>PRS CLK Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMECMP0</name>
          <description>No Description</description>
          <addressOffset>0x060</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x017700FF</resetMask>
          <fields>
            <field>
              <name>TCMPVAL</name>
              <description>Timer comparator 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSTART</name>
              <description>Timer start source</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Comparator 0 is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXEOF</name>
                  <description>Comparator 0 and timer are started at TX end of frame</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXC</name>
                  <description>Comparator 0 and timer are started at TX Complete</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXACT</name>
                  <description>Comparator 0 and timer are started at RX going going Active (default: low)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXEOF</name>
                  <description>Comparator 0 and timer are started at RX end of frame</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSTOP</name>
              <description>Source used to disable comparator 0</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TCMP0</name>
                  <description>Comparator 0 is disabled when the counter equals TCMPVAL and triggers a TCMP0 event</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXST</name>
                  <description>Comparator 0 is disabled at TX start TX Engine</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXACT</name>
                  <description>Comparator 0 is disabled on RX going going Active (default: low)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXACTN</name>
                  <description>Comparator 0 is disabled on RX going Inactive</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESTARTEN</name>
              <description>Restart Timer on TCMP0</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable the timer restarting on TCMP0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable the timer restarting on TCMP0</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
