NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/BGM24/BGM240PB32VNA.svd
        <register>
          <name>CHFCTRL</name>
          <description>No Description</description>
          <addressOffset>0x21C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xB0000003</resetMask>
          <fields>
            <field>
              <name>FWSWCOEFFEN</name>
              <description>FW Switch CHF COE. Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FWSELCOEFF</name>
              <description>FW Select CHF COE. set</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHFSWSEL</name>
              <description>Channel filter switch selection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PREDET</name>
                  <description>When swcoeffen == 1, use demod_predet to select coefficient set</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRC_SUP</name>
                  <description>Use ctecoeset when in RX_SUP, coefficient set 0 otherwise</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHFSWTRIG</name>
                  <description>Use the timer CHFSWTRIG to select the coefficient set, set 0 otherwise</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVALID</name>
                  <description>Coefficient set 0</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWCOEFFEN</name>
              <description>Switch CHF COE. Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHFLATENCYCTRL</name>
          <description>No Description</description>
          <addressOffset>0x220</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>CHFLATENCY</name>
              <description>CHF Latency</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FRMSCHTIME</name>
          <description>No Description</description>
          <addressOffset>0x224</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000040</resetValue>
          <resetMask>0xE000FFFF</resetMask>
          <fields>
            <field>
              <name>FRMSCHTIME</name>
              <description>FRAME SCH TIME OUT THRD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMRSTSYCNEN</name>
              <description>ENABLE CLEAN SYNC</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSARSTSYCNEN</name>
              <description>ENABLE CLEAN SYNC</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMENDSCHEN</name>
              <description>EnABLE SCH PM END</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PREFILTCOEFF</name>
          <description>No Description</description>
          <addressOffset>0x228</addressOffset>
          <access>read-write</access>
          <resetValue>0x3B3B3B3B</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PREFILTCOEFF</name>
              <description>Preamble Filter Coefficients</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXRESTART</name>
          <description>No Description</description>
          <addressOffset>0x22C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00001860</resetValue>
          <resetMask>0xC0011FF1</resetMask>
          <fields>
            <field>
              <name>RXRESTARTUPONMARSSI</name>
              <description>Restart RX upon RSSI MA above threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXRESTARTMATHRESHOLD</name>
              <description>Threshold for the RSSI MA filter</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DB0</name>
                  <description>0 DB</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DB1</name>
                  <description>1 DB</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DB2</name>
                  <description>2 DB</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DB3</name>
                  <description>3 DB</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DB4</name>
                  <description>4 DB</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DB5</name>
                  <description></description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DB6</name>
                  <description>6 DB</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DB7</name>
                  <description></description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DB8</name>
                  <description></description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DB9</name>
                  <description></description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DB10</name>
                  <description></description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DB11</name>
                  <description></description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DB12</name>
                  <description></description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DB13</name>
                  <description></description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DB14</name>
                  <description></description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DB15</name>
                  <description>15 DB</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXRESTARTMALATCHSEL</name>
              <description>latch the RSSI MA filter output</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RE_PRE_DET</name>
                  <description>rising edge of per det</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RE_SYNC_DET</name>
                  <description>rising edge of sync det</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EITHER1</name>
                  <description>either of the two</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EITHER2</name>
                  <description>either of the two</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXRESTARTMACOMPENSEL</name>
              <description>Enable the comparator</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PRE_DET</name>
                  <description>preamble detection</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRAME_SYNC_DET</name>
                  <description>frame/sync detection</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH1</name>
                  <description>both preamble and frame/sync detection</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH2</name>
                  <description>both preamble and frame/sync detection</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXRESTARTMATAP</name>
              <description>Number of taps for the MA filter</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TAPS4</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TAPS8</name>
                  <description></description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXRESTARTB4PREDET</name>
              <description>whether to restart RX before pre det</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANTSWRSTFLTTDIS</name>
              <description>ANT SW RESET Filter Disable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLTRSTEN</name>
              <description>RX Chain Filter reset enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SQ</name>
          <description>No Description</description>
          <addressOffset>0x230</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFF0003</resetMask>
          <fields>
            <field>
              <name>SQEN</name>
              <description>SQ enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SQSWRST</name>
              <description>SQ hold demod</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SQTIMOUT</name>
              <description>SQ Timeout</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SQEXT</name>
          <description>No Description</description>
          <addressOffset>0x234</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SQSTG2TIMOUT</name>
              <description>SQ Timeout</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SQSTG3TIMOUT</name>
              <description>SQ Timeout</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SQI</name>
          <description>No Description</description>
          <addressOffset>0x238</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FF0001</resetMask>
          <fields>
            <field>
              <name>SQISELECT</name>
              <description>SQI selection bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CORR</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERROR</name>
                  <description></description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHIPERROR</name>
              <description>Chip errors</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ANTDIVCTRL</name>
          <description>No Description</description>
          <addressOffset>0x23C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000007FF</resetMask>
          <fields>
            <field>
              <name>ADPRETHRESH</name>
              <description>Preamble threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENADPRETHRESH</name>
              <description>Enable Preamble threshold</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable use of Preamble threshold after timing detection</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable use of Preamble threshold after timing detection</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ANTDIVDISCCA</name>
              <description>Antenna switch disable for CSMA</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANTDIVSELCCA</name>
              <description>Antenna switch selection for CSMA</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ANTDIVFW</name>
          <description>No Description</description>
          <addressOffset>0x240</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x80000003</resetMask>
          <fields>
            <field>
              <name>FWSELANT</name>
              <description>FW antenna selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FWANTSWCMD</name>
              <description>FW Antenna SW cmd</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FWANTDIVEN</name>
              <description>Enable FW ANT-DIV mode</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PHDMODANTDIV</name>
          <description>No Description</description>
          <addressOffset>0x244</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000000F</resetValue>
          <resetMask>0x40FF1FFF</resetMask>
          <fields>
            <field>
              <name>ANTWAIT</name>
              <description>ANTENNA WAIT TIME</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SKIPRSSITHD</name>
              <description>RSSI THD to SKIP 2th  ANTENNA Evaluate</description>
              <bitOffset>5</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SKIPCORRTHD</name>
              <description>CORR THD to SKIP 2th  ANTENNA Evaluate</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SKIP2ANT</name>
              <description>SKIP 2th  ANTENNA Evaluate</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PHANTDECSION</name>
          <description>No Description</description>
          <addressOffset>0x248</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xF007FFFF</resetMask>
          <fields>
            <field>
              <name>CORRANDDIVTHD</name>
              <description>Correlation Selection in region</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSSIANDDIVTHD</name>
              <description>RSSI Selection in region</description>
              <bitOffset>10</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSSICORR0</name>
              <description>RSSI-CORR  Selection in Region0 </description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSSICORR1</name>
              <description>RSSI-CORR  Selection in Region1 </description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSSICORR2</name>
              <description>RSSI-CORR  Selection in Region2 </description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSSICORR3</name>
              <description>RSSI-CORR  Selection in Region3 </description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
